[
    {
        "title": "CRM-Entwicklung bei VDI/VDE Innovation + Technik GmbH",
        "shortDescription": "Entwicklung und Erweiterung eines Dynamics 365 CRM-Systems...",
        "rolle": "Dynamics 365 CE Developer / Consultant",
        "description": "Die VDI/VDE Innovation + Technik GmbH ist ein Projektträger sowie Dienstleistungs- und Beratungsunternehmen für verschiedene Bundes- und Landesministerien, die Europäische Kommission sowie die Finanzwirtschaft und Industrie – vor allem für kleine und mittlere Unternehmen. Im Fokus stehen gesellschaftliche und technische Herausforderungen wie Digitalisierung, demografischer Wandel, Mensch-Technik-Interaktion, Elektromobilität, Elektronik, Gesundheit, Bildung und Fragen der Innovationspolitik.",
        "aufgaben": [
            "Neu- und Weiterentwicklung von Anforderungen",
            "Analyse, Konzeption und Implementierung von komplexen Lösungen im Zuge der Weiterentwicklung von neuen und bestehenden Applikationen"
        ],
        "technologien": "Javascript, C#, React",
        "von": "01/2024",
        "bis": "12/2025",
        "logo": "./static/images/vdivde.png",
        "link": "https://vdivde-it.de/en",
        "types": "dynamics,software"
    },
    {
        "title": "Automatisierung von Geschäftsprozessen bei Longial",
        "shortDescription": "Teil- bis Vollautomatisierung von Geschäftsprozessen im Unternehmen...",
        "rolle": "Dynamics 365 CE Developer / Consultant",
        "description": "Longial bietet als eigenständiger und neutraler Dienstleister Lösungen zu allen Fragen der betrieblichen Altersversorgung aus einer Hand. Im Fokus des Projekts steht die teilweise bis vollständige Automatisierung von Geschäftsprozessen im Unternehmen.",
        "aufgaben": [
            "Neu- und Weiterentwicklung von Anforderungen",
            "Analyse, Konzeption und Implementierung von komplexen Lösungen im Zuge der Weiterentwicklung von neuen und bestehenden Applikationen",
            "Analyse, Konzeption und Implementierung neuer sowie bestehender Geschäftsprozesse"
        ],
        "technologien": "Javascript, C#",
        "von": "09/2023",
        "bis": "12/2023",
        "logo": "./static/images/ergo.png",
        "types": "dynamics,software",
        "link": "https://www.ergo.com/de/unternehmen/ueber-ergo/technologie-und-service-provider/itergo-informationstechnologie"
    },
    {
        "title": "Energie-Managementsystem bei HOCHHUTH GmbH",
        "shortDescription": "Migration von SmartCRM und Integration von Energiemanagement-Lösungen...",
        "rolle": "Dynamics 365 CE Developer / Consultant",
        "description": "HOCHHUTH bietet umfassende Energiemanagement-Lösungen an, darunter das ENERGY IN INDUSTRY® System, das Unternehmen hilft, ihre Energiekosten zu senken. Basierend auf dem M-Bus ermöglicht es die Online-Zählerfernauslesung und wurde bereits in über 500 Unternehmen erfolgreich implementiert. Ihr Firmensitz beherbergt Europas größtes M-Bus System und dient als Plattform für zukünftige Technologieentwicklungen im Energiemanagement. Zusätzlich beraten sie Unternehmen bei der Auswahl von Zähleinrichtungen und der Optimierung von Energieerzeugungsanlagen.",
        "aufgaben": [
            "Unterstützung bei der Migration von SmartCRM auf Dynamics 365",
            "Analyse, Konzeption und Implementierung neuer Funktionalitäten",
            "Analyse und Kostenschätzung für die Integration von unternehmenseigenen Softwarelösungen in Dynamics 365."
        ],
        "technologien": "Javascript, C#, SSIS",
        "von": "08/2023",
        "bis": "11/2023",
        "logo": "./static/images/hochhuth.png",
        "types": "dynamics,software",
        "link": "https://hochhuth.de/software/"
    },
    {
        "title": "Digitalisierung bei Lufthansa Industry Solutions",
        "shortDescription": "Unterstützung bei der Digitalisierung und Automatisierung von Geschäftsprozessen...",
        "rolle": "Dynamics 365 CE Developer",
        "description": "Lufthansa Industry Solutions unterstützt Unternehmen bei der dafür notwendigen Digitalisierung und Automatisierung ihrer Geschäftsprozesse – vom Mittelständler bis zum DAX-Konzern. Dabei legen sie ihren Fokus nicht nur auf die dafür notwendige IT, sondern auf das Geschäft ihrer Kunden mit seinen internen und externen Herausforderungen. Denn die digitale Transformation umfasst die gesamte Unternehmensstruktur und -kultur und reicht über die Unternehmensgrenzen hinaus bis hin zur Zusammenarbeit mit Partnern, Kunden und Lieferanten.",
        "aufgaben": [
            "Analyse, Konzeption und Implementierung von komplexen Lösungen im Zuge der Weiterentwicklung von neuen und bestehenden Applikationen",
            "Lösungen für UI-Erweiterungen, DSGVO und Asset-Management Funktionen",
            "Verwaltung und Deployment der entwickelten Anpassungen"
        ],
        "technologien": "Javascript, C#, nodeJs, Power Automate",
        "von": "08/2022",
        "bis": "11/2022",
        "logo": "./static/images/lufthansa.png",
        "types": "dynamics,software",
        "link": "https://www.lufthansa-industry-solutions.com/de-en/"
    },
    {
        "title": "Asset Management bei Commerz Real",
        "shortDescription": "Anpassung und Integration des CRM-Systems für Asset Management...",
        "rolle": "Dynamics 365 CE Developer",
        "description": "Die Commerz Real ist ein Asset Manager mit umfassendem Know-how im Assetmanagement und einer breiten Strukturierungsexpertise zur bündeln von Investmentprodukten für private und institutionelle Anleger, individuellen Finanzierungsstrukturierungen für gewerbliche Projekte und alternativen Finanzierungslösungen für Firmenkunden Der Fokus des Projekts liegt darin, das CRM-System den digitalen Anforderungen anzupassen und zu integrieren. Die Durchführung erfolgt in agiler Methodik, unter Einsatz von User Stories, Epics und Features.",
        "aufgaben": [
            "Analyse, Konzeption und Implementierung von komplexen Lösungen im Zuge der Weiterentwicklung von bestehenden Applikationen für vier Unternehmensbereiche",
            "Lösungen für UI Erweiterungen, DSGVO und Asset-Management Funktionen",
            "Verwaltung und Deployment der entwickelten Anpassungen"
        ],
        "technologien": "Javascript, C#, PCF-Control, nodeJs",
        "von": "05/2022",
        "bis": "09/2022",
        "logo": "./static/images/Commerz_Real_logo.svg",
        "types": "dynamics,software",
        "link": "https://www.commerzreal.com/"
    },
    {
        "title": "Einführung einer Mandantenfähigkeit im CRM-System",
        "shortDescription": "Erstellung und Implementierung einer Mandantenfähigkeit in Dynamics 365 CE...",
        "rolle": "Dynamics 365 CE Developer / Consultant",
        "description": "Die VDI/VDE Innovation + Technik GmbH ist ein Projektträger sowie Dienstleistungs- und Beratungsunternehmen für verschiedene Bundes- und Landesministerien, die Europäische Kommission sowie die Finanzwirtschaft und die Industrie, dort vor allem für Kleine und mittlere Unternehmen. Im Fokus stehen gesellschaftliche und technische Herausforderungen wie Digitalisierung, demografischer Wandel, Mensch-Technik-Interaktion, Elektromobilität, Elektronik, Gesundheit, Bildung und Fragen der Innovationspolitik. Der Fokus des Projekts liegt darin, das CRM-System auf ein akzeptables Niveau zu entwickeln, die Benutzerfreundlichkeit zu verbessern und funktionale Aktivitäten zu implementieren. Die Durchführung umfasste die Einführung in die agile Methodik, den Einsatz von User Stories, Epics und Features, die Erstellung und Durchführung von Workshops, Trainings, Show und Tells sowie UAT.",
        "aufgaben": [
            "Neu- und Weiterentwicklung von Anforderungen",
            "Analyse, Konzeption und Implementierung einer Softwarelösung zur Automatisierung der Benutzerzuordnung in Dynamics 365",
            "Verwaltung und Deployment der entwickelten Anpassungen",
            "Entwicklung einer effizienteren Deployment-Strategie",
            "Umstrukturierung des Repositorys zur besseren Auffindbarkeit relevanter Inhalte",
            "Einführung von Unittests in das System zur Sicherzustellung der Code-Qualität und Funktionalität."
        ],
        "technologien": "Javascript, C#, React",
        "von": "01/2022",
        "bis": "08/2023",
        "logo": "./static/images/vdivde.png",
        "types": "dynamics,software",
        "link": "https://vdivde-it.de/en"
    },
    {
        "title": "Internes Logistik-Webportal",
        "shortDescription": "Entwicklung eines internen Webportals zur Aufnahme von Lagerbeständen...",
        "rolle": "Projektleiter / Senior Developer / Analyst",
        "description": "Für ein Kleinunternehmen im Logistiksektor wurde ein Webportal entwickelt, das die Erfassung und Verwaltung von Lagerbeständen ermöglicht. Hierbei wurden sowohl die Infrastruktur geplant als auch die Umsetzung der Lösung koordiniert.",
        "aufgaben": [
            "Analyse der Anforderungen und Planung der Infrastruktur",
            "Umsetzung des Webportals und Definition von Datenstrukturen",
            "Erstellung der Programmdokumentation",
            "Durchführung statischer Codeanalysen und automatisierter Tests",
            "Einführung von Continous Delivery Pipelines"
        ],
        "technologien": "React, Typescript, SQLite",
        "von": "07/2021",
        "bis": "09/2021",
        "logo": "./static/images/logistik.svg",
        "types": "software",
        "link": null
    },
    {
        "title": "Modernisierung interner Software bei Meta Trennwandanlagen",
        "shortDescription": "Modernisierung und Wartung der bestehenden Softwarelandschaft, Einführung von CI/CD-Pipelines...",
        "rolle": "Projektleiter / Senior Developer / Analyst",
        "description": "Sie sind Experten auf zahlreichen Anwendungsbereichen und bieten passende Produkte für jede Branche. Neben WC-Trennwänden für Gastronomie und Hotels sowie Büros und öffentliche Einrichtungen haben sie sich auf weitere Einsatzgebiete spezialisiert. Dazu gehören Schulen, Kindergärten und Kindertagesstätten, Sportanlagen und Schwimmbäder. In diesen Einrichtungen benötigen ihre Kunden Duschtrennwände, Schränke und Bänke mit Hakenleisten. Daher stattet das Unternehmen sie mit hochwertigen Produkten für Sanitär- sowie Umkleideräume und maßgeschneiderten Lösungen aus. Für Meta Trennwandanlagen wurde die bestehende Softwarelandschaft modernisiert. Neben der Wartung und Optimierung interner Prozesse wurden individuelle Anpassungen implementiert – unterstützt durch den Einsatz von Tools wie Git und Jenkins.",
        "aufgaben": [
            "Modernisierung und Wartung der bestehenden Softwarelandschaft",
            "Implementierung individueller Anpassungen",
            "Analyse und Optimierung interner Prozesse",
            "Einführung von Continous Delivery Pipelines"
        ],
        "technologien": "Python, Jenkins, Git, Prometheus, Grafana, InformixDB, FastApi, Flask",
        "von": "02/2021",
        "bis": "07/2021",
        "logo": "./static/images/meta.png",
        "types": "software",
        "link": "https://www.meta.de/de/"
    },
    {
        "title": "Marktreife Einführung des HMI-Prototyps",
        "shortDescription": "Überführung des Datensammler-Prototyps in den Release und Schulung der Außendienstmitarbeiter...",
        "rolle": "Senior Developer / Analyst / Tester / Software Architekt",
        "description": "Im Schiffsbausektor wurde ein Datensammler-Prototyp weiterentwickelt und in den offiziellen Release überführt. Neben der Weiterentwicklung der Programmelemente erfolgte auch eine umfassende Schulung der Außendienstmitarbeiter sowie eine abschließende Feedbackanalyse.",
        "aufgaben": [
            "Überführung des Datensammler-Prototyps in den Release",
            "Schulung der Außendienstmitarbeiter",
            "Analyse und Behebung finaler Probleme"
        ],
        "technologien": "Python, Jenkins, Git, MQTT, ZeroMQ, Microservices, SQLite, Gherkin, Cucumber, Jasmine, Confluence, Jira, Django",
        "von": "10/2020",
        "bis": "01/2021",
        "logo": "./static/images/schottel.png",
        "types": "software",
        "link": "https://www.schottel.de/home"
    },
    {
        "title": "Prototyp-Entwicklung zur Schiffsdaten-Analyse",
        "shortDescription": "Entwicklung eines Prototyps zur Sammlung und Analyse schiffbezogener Daten...",
        "rolle": "Senior Developer / Analyst / Tester / Software Architekt",
        "description": "In einem weiteren Projekt im Schiffsbau wurde ein Prototyp entwickelt, der die Erfassung und Analyse schiffbezogener Daten ermöglicht. Ergänzt wurde dies durch ein Kundenportal, in dem die Daten visualisiert werden.",
        "aufgaben": [
            "Entwicklung eines Prototyps zur Sammlung schiffbezogener Daten",
            "Definition von Datenstrukturen und Kommunikationswegen",
            "Beratung und Umsetzung von Automatisierungslösungen",
            "Testen der Software unter Anwenderbedingungen",
            "Erstellung und Pflege der Programmdokumentation"
        ],
        "technologien": "Python, Jenkins, Git, MQTT, ZeroMQ, Microservices, SQLite, Gherkin, Cucumber, Jasmine, Confluence, Jira, Django",
        "von": "05/2019",
        "bis": "10/2020",
        "logo": "./static/images/schottel.png",
        "types": "software",
        "link": "https://www.schottel.de/home"
    },
    {
        "title": "Proof of Concept Schiffsdaten",
        "shortDescription": "Erstellung eines Proof of Concept zur Validierung kritischer Anforderungen im Schiffsbau...",
        "rolle": "Senior Developer / Analyst / Tester / PO",
        "description": "Im Rahmen eines Projekts im Schiffsbausektor wurde ein Proof of Concept entwickelt, um kritische Anforderungen zu validieren. Dazu gehörten Marktforschung, Bedarfsanalyse sowie die Planung der Softwarearchitektur und der Kommunikationswege.",
        "aufgaben": [
            "Erstellung eines Proof of Concept",
            "Analyse des Marktes und Ermittlung des Bedarfs",
            "Planung und Beschaffung der notwendigen Hardware",
            "Planung der Softwarearchitektur",
            "Analyse und Planung der verfügbaren Ressourcen Definition von Einflussgrößen, Datenstrukturen und Kommunikationswegen"
        ],
        "technologien": "Python, Confluence, Jira, Draw.io, Visual Paradigm",
        "von": "02/2019",
        "bis": "05/2019",
        "logo": "./static/images/schottel.png",
        "types": "software",
        "link": "https://www.schottel.de/home"
    },
    {
        "title": "Deployment Tool Einführung",
        "shortDescription": "Einführung eines Deployment Tools zum automatisierten Rollout der betriebenen Software...",
        "rolle": "Developer / Tester / PO",
        "description": "Die SCHOTTEL GmbH umfasst die Propulsionsaktivitäten der SCHOTTEL-Gruppe. Sie ist gleichzeitig die Wurzel und das größte Unternehmen der heutigen SCHOTTEL-Gruppe, aus der sich seit der Gründung im Jahr 1921 ein weltweit führendes Unternehmen im Bereich der Schiffsantriebe entwickelte. Die SCHOTTEL GmbH konstruiert, produziert und vertreibt rundum steuerbare Antriebs- und Manövriersysteme sowie komplette Antriebsanlagen bis 30 MW Leistung für Schiffe aller Art und Größe. Automationssysteme und Marine Services runden die Betreuung rund um den Lebenszyklus eines Schiffs ab.",
        "aufgaben": [
            "Analyse der Anforderungen und Planung der Architektur",
            "Umsetzung des Deployment Tools",
            "Schulung der Mitarbeiter",
            "Erstellung und Pflege der technischen sowie anwenderspezifischen Dokumentation"
        ],
        "technologien": "Python, Tkinter, ZeroMQ, Reddis, Debian",
        "von": "02/2018",
        "bis": "01/2019",
        "logo": "./static/images/schottel.png",
        "types": "software",
        "link": "https://www.schottel.de/home"
    },
    {
        "title": "CRM-Unterstützung bei Schröder Landmaschinen",
        "shortDescription": "Unterstützung und Weiterentwicklung eines produktiven Dynamics 365 CRM-Systems im Tagesgeschäft...",
        "rolle": "Dynamics 365 CE Developer / Consultant",
        "description": "Die Schröder Landmaschinen Gruppe ist ein Handels- und Serviceunternehmen im Bereich Land- und Kommunaltechnik. Zum Zeitpunkt des Einsatzes war das Microsoft Dynamics 365 CRM-System bereits produktiv im Einsatz. Die Tätigkeit umfasste die operative Unterstützung sowie gezielte Weiterentwicklungen zur Stabilisierung und Optimierung laufender Geschäftsprozesse in Vertrieb, Service und Werkstatt.",
        "aufgaben": [
            "Operative Unterstützung im laufenden Betrieb des Dynamics 365 CRM-Systems",
            "Analyse und Behebung von Fehlern im Produktivsystem",
            "Umsetzung kleinerer Anpassungen und Optimierungen an bestehenden Funktionen",
            "Unterstützung der Anwender bei fachlichen und technischen Fragestellungen",
            "Enge Abstimmung mit Fachabteilungen zur schnellen Umsetzung von Anforderungen"
        ],
        "technologien": "JavaScript, C#, Dynamics 365 CE, Power Automate",
        "von": "11/2025",
        "bis": "02/2026",
        "logo": "./static/images/schroeder.png",
        "types": "dynamics,software",
        "link": "https://www.schroeder-gruppe.de"
    },
    {
        "title": "Lead Fullstack Development bei WECOYA UNDERWRITING GmbH",
        "shortDescription": "Leitung der Fullstack-Entwicklung und Weiterentwicklung von Dynamics-365-Lösungen in einer produktiven Versicherungsumgebung...",
        "rolle": "Lead Fullstack Developer MS Dynamics",
        "description": "Die WECOYA UNDERWRITING GmbH ist ein international tätiger Assekuradeur und Teil der GGW Group. Das Unternehmen entwickelt maßgeschneiderte Versicherungslösungen und übernimmt den gesamten Underwriting-Prozess von der Risikobewertung bis zur Policierung. In meiner Rolle als Lead Fullstack Developer bin ich verantwortlich für die technische Architektur, Weiterentwicklung und den stabilen Betrieb zentraler Dynamics-365- und Business-Applikationen. Der Fokus liegt auf skalierbaren Lösungen, Systemintegrationen und der engen Zusammenarbeit mit Fachbereichen zur Digitalisierung und Optimierung von Versicherungsprozessen.",
        "aufgaben": [
            "Technische Gesamtverantwortung für Dynamics-365-basierte Anwendungen",
            "Architektur und Umsetzung von Fullstack-Lösungen (Client- und Server-seitig)",
            "Analyse und Umsetzung fachlicher Anforderungen in enger Abstimmung mit Stakeholdern",
            "Integration externer Systeme über APIs und Power Platform",
            "Sicherstellung von Stabilität, Performance und Wartbarkeit im Produktivbetrieb",
            "Mentoring und technische Unterstützung weiterer Entwickler"
        ],
        "technologien": "Dynamics 365 CE, Power Platform, JavaScript, TypeScript, C#, Azure DevOps, APIs",
        "von": "02/2026",
        "bis": "aktuell",
        "logo": "./static/images/wecoya.png",
        "types": "dynamics,software",
        "link": "https://www.wecoya.com"
    }
]